added mermaid diagram
